src/cf/Catalogs/fmProducts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmProducts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCounterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ProductKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ProductKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Product</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmProducts/Forms/ItemForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////// 
//// EVENT HANDLERS
////

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DetermineEnabled(ThisObject);
	
	// StandardSubsystems.Properties
	//PropertyManagement.OnCreateAtServer(ThisObject, , "AdditionalAttributesGroup");
	// End StandardSubsystems.Properties
	
EndProcedure

//&AtServer
//Procedure OnReadAtServer(CurrentObject)
//	
//	// StandardSubsystems.Properties
//	PropertyManagement.OnReadAtServer(ThisObject, CurrentObject);
//	// End StandardSubsystems.Properties
//	
//EndProcedure
//	
//&AtServer
//Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
//	
//	// StandardSubsystems.Properties
//	PropertyManagement.BeforeWriteAtServer(ThisObject, CurrentObject);
//	// End StandardSubsystems.Properties
//	
//EndProcedure

&AtClient
Procedure KindOnChange(Element)
	DetermineEnabled(ThisForm);
EndProcedure

//&AtClient
//Procedure NotificationProcessing(EventName, Parameter, Source)
//	
//	// StandardSubsystems.Properties 
//	Если PropertyManagementClient.ProcessNofifications(ThisObject, EventName, Parameter) Тогда
//     	UpdateAdditionalAttributeItems();
// 	КонецЕсли;
// 	// End StandardSubsystems.Properties
//	
//EndProcedure

//&AtServer
//Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
//	
//	// StandardSubsystems.Properties
//	PropertyManagement.FillCheckProcessing(ThisObject, Cancel, CheckedAttributes);
//	// End StandardSubsystems.Properties
//	
//EndProcedure

//////////////////////////////////////////////////////////////////////////////// 
// Form procedures and functions

// Sets the Enabled flag of items depending on what is being edited:
// product or service.
//
&AtClientAtServerNoContext
Procedure DetermineEnabled(Form)

	ProductAttributesEnabled = Form.Object.Kind = PredefinedValue("Enum.ProductKinds.Product");
	Form.Items.Barcode.Enabled = ProductAttributesEnabled;
	Form.Items.Vendor.Enabled = ProductAttributesEnabled;
	Form.Items.Sku.Enabled = ProductAttributesEnabled;

EndProcedure

//// StandardSubsystems.Properties

//&AtClient
//Процедура Attachable_EditPropertyContent()
//	
//	PropertyManagementClient.EditPropertyContent(ThisObject, Object.Ref);
//	
//КонецПроцедуры

//&AtServer
//Процедура UpdateAdditionalAttributeItems()
//	
//     PropertyManagement.UpdateAdditionalAttributeItems(ThisObject);
//	 
//КонецПроцедуры

//// End StandardSubsystems.Properties
